[
  {
    "month": "May",
    "year": "2024",
    "title": "Foundation and Vision",
    "desc": "This phase focuses on establishing the necessary infrastructure and forging key collaborations essential for the foundational structure of the business."
  },
  {
    "month": "August",
    "year": "2024",
    "title": "Launchpad & Onboarding",
    "desc": "In this stage, the emphasis is on rolling out the Launchpad, developing essential project management tools, and hosting events to engage stakeholders."
  },
  {
    "month": "November",
    "year": "2024",
    "title": "Social Mining",
    "desc": "The key activities involve launching a platform dedicated to social mining, incentivizing user engagement, and organizing community-centric events."
  },
  {
    "month": "February",
    "year": "2025",
    "title": "ISO & Engagement",
    "desc": "This phase is about introducing an ISO platform, developing a robust review system, and organizing various events to boost engagement."
  },
  {
    "month": "May",
    "year": "2025",
    "title": "Trading Ecosystem",
    "desc": "The focus here is on introducing innovative AI-driven trading tools and conducting comprehensive training sessions to educate users or team members."
  },
  {
    "month": "August",
    "year": "2025",
    "title": "Team & Skill Enhancement",
    "desc": "This stage involves recruiting industry experts, providing extensive training to the team, and launching a platform for enhanced team interaction."
  },
  {
    "month": "November",
    "year": "2025",
    "title": "AI Plugin Play",
    "desc": "The key tasks include launching a specialized platform, creating a library of AI plugins, and conducting workshops to facilitate knowledge sharing and skill development."
  },
  {
    "month": "February",
    "year": "2026",
    "title": "AI & Data Integration",
    "desc": "This phase is centered on the development of AI algorithms, integrating these insights for enhanced decision-making, and hosting events focused on AI advancements."
  },
  {
    "month": "May",
    "year": "2026",
    "title": "Security & Trust",
    "desc": "The activities focus on implementing robust protection mechanisms, publishing detailed reports to establish transparency, and hosting events to emphasize security."
  },
  {
    "month": "August",
    "year": "2026",
    "title": "Integration & Outreach",
    "desc": "This final phase ensures seamless integration of all platforms, explores opportunities for global expansion, and sets the vision for the future of the business."
  }
]
